Revit 2024 API
ViewSchedule.SetStripedRowsColor Method
 Sets the color applied to part of the pattern for a schedule with striped rows.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public void SetStripedRowsColor(
	StripedRowPattern index,
	Color color
)
Visual Basic
Public Sub SetStripedRowsColor ( _
	index As StripedRowPattern, _
	color As Color _
)
Visual C++
public:
void SetStripedRowsColor(
	StripedRowPattern index,
	Color^ color
)
Parameters
index
Type: Autodesk.Revit.DB.StripedRowPattern
 The part of the striped row pattern.
color
Type: Autodesk.Revit.DB.Color
 The color which will be used in striped row pattern.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace